using System;

namespace Some_Fibonacci_Primes
{
    class Some_Fibonacci_primes
    {
        public static int get_fibonacci_position(int numb) //функция която връща позицията във фибоначи редицата на подадено число, а ако подаденото й число не е от фибоначи редицата връща 0
        {
            int fibonacci_prev = 0;
            int fibonacci_next = 1;
            int fibonacci_current;//буферна променлива с помоща на която да запазваме 2те фибоначи числа от които да се образува следващото в следващата итерация на цикъла, за да можем да ги отброяваме.
            for (int i = 2; fibonacci_next <= numb + fibonacci_prev; i++)//i е брояч на поредното фибоначи число, започва от 2 защото първите две числа са вече зададени в fibonacci_prev и fibonacci_next
            {
                //Console.WriteLine(fibonacci_next);// беше за парсване на резултата.
                if (fibonacci_next == numb)
                {
                    return i;// когато новото фибоначи число се окаже равно на запитаното следователно запитаното число е от редицата на фибоначи и тука връщаме поредния му номер i
                }
                if (fibonacci_next > numb)
                {
                    return 0;//ако поредното число на фибоначи е станало по голямо от запитаното число и цикъла не е спрял на равенство, значи запитаното число е между предходното фибоначи число и следващото и не е от редицата на фибоначи
                }
                fibonacci_current = fibonacci_next;
                fibonacci_next = fibonacci_prev + fibonacci_next;//образуваме новото фибоначи число от поредицата
                fibonacci_prev = fibonacci_current;// складираме старото фибоначи число, за да може на следващия такт от старото и новото да образуваме следващото фибоначи число
            } return -1;//не е възможно да попадне тук при вярна логика по нагоре и вярно подадено int число.
        }
        static void Main()
        {
            int if89 = get_fibonacci_position(89);
            int if547 = get_fibonacci_position(547);
            int if1597 = get_fibonacci_position(1597);
            if (if89 == 0)
            {
                Console.WriteLine("{0} просто число е {1} и то не е от редицата на фибоначи", "24тото", "89");
            }
            else
            {
                Console.WriteLine("{0} просто число е {1} и то е с пореден номер {2} от редицата на фибоначи ", "24тото", "89", if89);
            }
            if (if547 == 0)
            {
                Console.WriteLine("{0} просто число е {1} и то не е от редицата на фибоначи", "101-то", "547");
            }
            else
            {
                Console.WriteLine("{0} просто число е {1} и то е с пореден номер {2} от редицата на фибоначи ", "101-то", "547", if547);
            }
            if (if1597 == 0)
            {
                Console.WriteLine("{0} просто число е {1} и то не е от редицата на фибоначи", "251-то", "1597");
            }
            else
            {
                Console.WriteLine("{0} просто число е {1} и то е с пореден номер {2} от редицата на фибоначи ", "251-то", "1597", if1597);
            }
        }
    }
}